# RoomCalculatedCoolingLoadPerAreaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomCalculatedCoolingLoadPerAreaParam Property
ParameterTypeId Class See Also
---
"Calculated Cooling Load per area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomCalculatedCoolingLoadPerAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomCalculatedCoolingLoadPerAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomCalculatedCoolingLoadPerAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace